import React, {  useState } from 'react';
import {
  ChakraProvider,
 // Box,
  Text,
 // Link,
 // VStack,
 // Code,
 // Grid,
  // theme,
  Flex,
  Button,
  Image,
  extendTheme
} from '@chakra-ui/react';

import 'bootstrap/dist/css/bootstrap.min.css';

import pgm1 from './img/pgm1.png'
import pgm2 from './img/pgm2.png'
import pgm3 from './img/pgm3.png'
import pgm4 from './img/pgm4.png'
import pgm5 from './img/pgm5.png'

import '@fontsource/raleway/400.css'
import '@fontsource/open-sans/700.css'

const theme = extendTheme({
  fonts: {
    heading: `'Open Sans', sans-serif`,
    body: `'Raleway', sans-serif`,
    
  },
})

const buttons = [
  {
    id: 1,
    name: 'button1',
    label: '1',
    imageUrl: pgm1,
    phrase: '111111111',
  },
  {
    id: 2,
    name: 'button2',
    label: '2',
    imageUrl: pgm2,
    phrase: '2222222222',
  },
  {
    id: 3,
    name: 'button3',
    label: '3',
    imageUrl: pgm3,
    phrase: '3333333333',
  },
  {
    id: 4,
    name: 'button4',
    label: '4',
    imageUrl: pgm4,
    phrase: '44444444444',
  },
  {
    id: 5,
    name: 'button5',
    label: '5',
    imageUrl: pgm5,
    phrase: '55555555555',
  },
];

const phrases = {
    button1: {
      head: 'КВАДРАТ',
      body: `
    Якщо вашою основною фігурою виявився квадрат, то ви невтомний трудівник. Працьовитість, старанність, потреба доводити розпочату справу до кінця, завзятість, що дозволяє добиватися завершення роботи — ось основні якості справжніх Квадратів.

    Витривалість, терпіння та методичність зазвичай роблять Квадрата висококласним фахівцем у своїй галузі. Цьому сприяє і невгамовна потреба в інформації. Всі відомості, які вони мають, систематизовані і розкладені по поличках. Квадрат здатний видати потрібну інформацію моментально. Тому Квадрати заслужено славляться ерудитами, принаймні у своїй галузі.
    
    Якщо ви вибрали для себе квадрат — фігуру лінійну, то, найімовірніше, ви належите до «лівопівкульних» мислителів, тобто до тих, хто переробляє дані в послідовному форматі: а-б-в-г… Вони швидше «обчислюють результат» », Що здогадуються про нього. Вони надзвичайно уважні до деталей, люблять лад. Їхній ідеал – розплановане, передбачуване життя, і їм не до вподоби зміна звичного перебігу подій. Вони постійно «упорядковують», організують людей та речі навколо себе.
    
    Усі ці якості сприяють тому, що Квадрати можуть стати добрими фахівцями — техніками, адміністраторами, але рідко бувають добрими менеджерами. Надмірна пристрасть до деталей, потреба в уточнюючій інформації для прийняття рішень позбавляє Квадрату оперативності.
    
    Акуратність, дотримання правил можуть розвинутися до крайності, що паралізує. Крім того, раціональність, емоційна сухість, консерватизм в оцінках заважають Квадратам швидко встановлювати контакти з різними особами. Квадрати неефективно діють у аморфної ситуації.
    `,
    } ,
    button2: {
      head: 'ТРИКУТНИК',
      body: `
    Ця форма символізує лідерство, і багато трикутників відчувають у цьому своє призначення. Найхарактерніша особливість істинного Трикутника – здатність концентруватися на головній меті. Вони – енергійні, сильні особистості.

    Трикутники, як та його родичі Квадрати, ставляться до лінійних форм також є «лівопівкульними» мислителями. Здатні глибоко та швидко аналізувати ситуації. Однак на противагу Квадратам, орієнтованим на деталі, трикутники зосереджуються на головному, на суті.
    
    Трикутник — це дуже впевнена людина, яка хоче бути правою у всьому! Потреба бути правим і потреба керувати ситуацією, вирішувати як за себе, а й, наскільки можна, інших, ведуть Трикутника до постійної готовності боротьби, суперництва.
    
    Трикутники насилу визнають свої помилки! Можна сказати, що бачать те, що хочуть бачити. Не люблять змінювати свої рішення, часто бувають категоричними. На щастя (для них і оточуючих), трикутники швидко і успішно навчаються (вбирають корисну інформацію як губка), щоправда, тільки тому, що відповідає їхній прагматичній орієнтації, сприяє досягненню головної мети.
    
    Трикутники честолюбні. Якщо справою честі для Квадрату є досягнення найвищої якості виконуваної роботи, то Трикутник прагне досягти високого становища, набути високого статусу, інакше кажучи — зробити кар’єру. З Трикутників виходять чудові менеджери.
    
    Головна негативна якість Трикутників – сильний егоцентризм, спрямованість на себе. На шляху до вершин влади вони не виявляють особливої ​​акуратності щодо моральних норм. Трикутники змушують все і всіх обертатися навколо себе… Можливо, без них життя втратило б свою гостроту.
    `,
    }, 
    button3: {
      head: 'ПРЯМОКУТНИК',
      body: `
    Ця фігура символізує стан переходу та зміни. Це тимчасова форма особистості, яку можуть «носити» решта чотирьох порівняно стійких фігур у певні періоди життя. Це люди, які не задоволені тим способом життя, який вони ведуть зараз, і тому зайняті пошуками кращого становища. Причини «прямокутного» стану можуть бути різними, але поєднує їх одне — значущість змін.

    Основним психічним станом Прямокутників є більш менш усвідомлюваний стан замішання, заплутаність у проблемах і невизначеність щодо себе на даний момент часу. Найбільш характерні риси – непослідовність та непередбачуваність вчинків протягом перехідного періоду. Вони мають, як правило, низьку самооцінку. Прагнуть стати кращими у чомусь, шукають нові методи роботи, стилі життя.
    
    Швидкі, круті та непередбачувані зміни у поведінці Прямокутника зазвичай бентежать і насторожують інших людей. Прямокутникам спілкування з іншими людьми просто необхідне, і в цьому полягає ще одна складність перехідного періоду.
    
    Однак, у Прямокутника виявляються і позитивні якості, які приваблюють до нього оточуючих: допитливість, допитливість, живий інтерес до всього, що відбувається, і… сміливість! Вони відкриті для нових ідей, цінностей, способів мислення та життя, легко засвоюють все нове. Щоправда, зворотною стороною цього є надмірна довірливість, навіюваність. Тому прямокутники легко маніпулювати. «Прямокутність» — лише стадія. Вона минеться!
    `,
    }, 
    button4: {
      head: 'КОЛО',
      body: `
    Коло – це міфологічний символ гармонії. Той, хто впевнено вибирає його, щиро зацікавлений насамперед у добрих міжособистісних відносинах. Найвища цінність для Кола – люди.

    Коло — найдобріша з п’яти форм. Воно найчастіше служить тим “клеєм”, який скріплює і робітничий колектив, і сім’ю. Кола – найкращі комунікатори завдяки своєму вмінню слухати співрозмовника. Вони мають високу чутливість, здатні співпереживати.
    
    Кола чудово «читають» людей і в одну хвилину здатні розпізнати удавальника, ошуканця. Кола «хворіють» за свій колектив і популярні серед колег по роботі. Однак вони, як правило, слабкі менеджери та керівники у сфері бізнесу.
    
    По-перше, Кола спрямовані скоріше на людей, ніж на справу. Намагаючись зберегти світ, вони іноді уникають займати «тверду» позицію та приймати непопулярні рішення. Для Кола немає нічого важчого, ніж вступати в міжособистісний конфлікт. Вони за всяку ціну прагнуть його уникнути. Іноді – на шкоду справі.
    
    По-друге, Кола взагалі не відрізняються рішучістю, часто не можуть подати себе належним чином. Однак Кола не надто переймаються, у чиїх руках перебуває влада. В одному Кола виявляють завидну твердість — якщо справа стосується моралі чи порушення справедливості.
    
    Коло — нелінійна форма, близька до «правопівкульних» мислителів, у яких переважають образи, інтуїція, емоції. Тому переробка інформації у Кругів здійснюється не послідовно, а скоріше мозаїчно, проривами.
    
    Це не означає, що Кола не в ладах з логікою. Просто формалізм у них не у пріоритетах. Головні риси в їхньому мисленні — орієнтація на суб’єктивні фактори проблеми (цінності, оцінки, почуття тощо) і прагнення знайти спільне навіть у протилежних точках зору. Можна сміливо сказати, що Коло — природжений психолог. Однак часто він слабкий організатор — йому не вистачає «лівопівкульних» навичок своїх «лінійних братів» — Трикутника та Квадрату.
    `,
    }, 
    button5: {
      head: 'ЗІГЗАГ',
      body: `
    Ця фігура символізує креативність, творчість, хоча б тому, що вона найунікальніша з п’яти фігур та єдина розімкнена фігура.

    Якщо ви твердо вибрали зигзаг як основну форму, то ви, швидше за все, істинний «правопівкульний» мислитель, інакомислячий. Вам ще більше ніж Колу властиві образність, інтуїтивність, інтегративність, мозаїчність. Сувора, послідовна дедукція – це не ваш стиль. Думка Зигзага робить відчайдушні стрибки від «а» до «я», тому багатьом «лівопівкульним» важко зрозуміти Зигзагів.
    
    Зигзаги зазвичай мають розвинене естетичне почуття. Домінуючим стилем мислення Зигзага найчастіше є синтетичний стиль. На відміну від Кругів, Зигзаги зовсім не зацікавлені в консенсусі та домагаються синтезу не шляхом поступок, а навпаки — загостренням конфлікту ідей та побудовою нової концепції, в якій цей конфлікт отримує свій дозвіл, «знімається». Причому, використовуючи свою природну дотепність, вони можуть бути вельми уїдливими, «розплющуючи очі» іншим.
    
    Зигзаги просто не можуть працювати у добре структурованих ситуаціях. Їх дратують чіткі вертикальні та горизонтальні зв’язки, суворо фіксовані обов’язки та постійні способи роботи. У роботі їм потрібна незалежність від інших та високий рівень стимуляції на робочому місці. Тоді Зигзаг “оживає” і починає виконувати своє основне призначення – генерувати нові ідеї.
    
    Зигзаги – ідеалісти, звідси беруть початок такі їхні риси, як непрактичність, наївність. Зигзаг – найбільш збудливий із п’яти фігур.
    
    Вони нестримні, дуже експресивні, що, поряд з їхньою ексцентричністю, часто заважає їм проводити свої ідеї в життя. До того ж вони не сильні у опрацюванні конкретних деталей і не надто наполегливі у доведенні справи до кінця (оскільки зі втратою новизни втрачається й інтерес до ідеї).
    `,
    }, 
  };

function App() {
  const [buttonsStates, setButtonsStates] = useState({
    button1: false,
    button2: false,
    button3: false,
    button4: false,
    button5: false,
  });
  const [ resultPhrase, setResultPhrase ] = useState(null);
  const [ isPhraseSet, setIsPhraseSet ] = useState(false);

  const buttonOnClick = (event) => {
    const {
      name
    } = event.target;

    setButtonsStates((currentState) => {
      return {
        ...currentState,
        [name]: true,
      }
    });

    if (!isPhraseSet) {
      console.log({
        1: phrases[name]
      })
      setResultPhrase({
        head: phrases[name].head,
        body: phrases[name].body,
      });
      setIsPhraseSet(true);
    }
  }

  return (
    <ChakraProvider theme={theme}>
      <Flex
        w="100%"
        minH="100vh"
        h="100%"
        justifyContent="center"
      >
        <Flex
          w="100%"
          h="100%"
          maxW="1440px"
        >
          <Flex
            padding="20px"
            w="100%"
            h="100%"
            flexDir="column"
            gap="20px"
            alignItems="center"
          >
            <Flex>
              <Text
                fontSize="31px"
              >
                Психогеометричний тест Сьюзен Деллінгер
              </Text>
            </Flex>
            <Flex
              flexDir="column"
              gap="10px"
            >
                <Text >
                  {`Психогеометричний тест - це проектна методика дослідження особистості, яка була представлена в 1978 році. Її автором є досить відома багатьом особа – Сьюзан Деллінгер, фахівець із соціально-психологічної підготовки управлінських кадрів, яка працює з такими великими компаніями, як General Telephone and Electronics, Chevrolet Motors, Honeywell та ін.`}
                </Text>
                <Text>
                  {`
                    Як теоретичні передумови, що лежать в основі науки, яку Сьюзан Деллінгер визначає як психогеометрію, названі — вчення Карла Юнга про психічні типи та уявлення про функціональну асиметрію півкуль головного мозку.
                  `}
                </Text>
                <Text fontWeight="bold">
                  {` Погляньте на фігури нижче:`}
                </Text>
            </Flex>
            <Flex
              gap="20px"
              marginBottom="20px"
            >
              {
                buttons && buttons.map(button => {
                  const {
                    name,
                    label,
                    id,
                    imageUrl,
                  } = button;
                  return (
                    <Button
                      key={id}
                      name={name}
                      onClick={buttonOnClick}
                      isDisabled={buttonsStates[name]}
                      w="105px"
                      h="85px"
                      p="0"
                      bgColor="#000"
                      _hover={{
                        bgColor: "#2bf52b",
                      }}
                    >
                      <Image
                        src={imageUrl}
                        alt={label}
                        name={name}
                        onClick={buttonOnClick}
                        w="105px"
                        h="85px"
                      />
                    </Button>
                  )
                })
              }
            </Flex>
            <Flex
              flexDir="column"
              gap="20px"
            >
              <Text >
                {
                  `Виберіть із них ту, щодо якої можете сказати: “Це – я!” Намагайтеся відчути свою форму. Якщо ви відчуваєте сильну скруту, виберіть із фігур ту, яка першою залучила вас.`
                }
              </Text>
              <Text>
                {
                  `Запишіть її назву під номером 1. Тепер пропрацюйте чотири фігури, що залишилися, в порядку вашої переваги (запишіть їх назви під відповідними номерами).`
                }
              </Text>
              <Text>
                {
                  `Отже, найважчий етап закінчено.`
                }
              </Text>
              <Text>
                {
                  `Яку б фігуру ви не помістили на перше місце – це ваша основна фігура чи суб’єктивна форма. Вона дає можливість визначити ваші головні, домінуючі риси характеру та особливості поведінки.`
                }
              </Text>
              <Text>
                {
                  `Інші чотири фігури – це своєрідні модулятори, які можуть офарблювати провідну мелодію вашої поведінки.`
                }
              </Text>
              <Text>
                {
                  `Остання фігура вказує на форму людини, взаємодія з якою представлятиме вам найбільші труднощі. Однак може виявитися, що жодна фігура вам не підходить. Тоді вас можна описати комбінацією із двох або навіть трьох форм.`
                }
              </Text>
            </Flex>
            <Flex
              flexDir="column"
              gap="10px"
            >
                {
                  buttonsStates.button1
                  && buttonsStates.button2
                  && buttonsStates.button3
                  && buttonsStates.button4
                  && buttonsStates.button5
                  && (
                    <>
                      <Text fontWeight="bold">
                        Короткі психологічні характеристики відповідних форм особистості:
                      </Text>
                      <Text as='mark' textAlign={[ 'left', 'center' ]}>
                        {resultPhrase && resultPhrase.head}
                      </Text>
                      <Text >
                        {resultPhrase && resultPhrase.body}
                      </Text>
                    </>
                    
                  )
                }
            </Flex>
          </Flex>
        </Flex>
      </Flex>
    </ChakraProvider>
  );
}

export default App;
